# Ex2 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [61]:
chipo = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv', delimiter='\t')
chipo

      order_id  ...  item_price
0            1  ...      $2.39
1            1  ...      $3.39
2            1  ...      $3.39
3            1  ...      $2.39
4            2  ...     $16.98
...        ...  ...         ...
4617      1833  ...     $11.75
4618      1833  ...     $11.75
4619      1834  ...     $11.25
4620      1834  ...      $8.75
4621      1834  ...      $8.75

[4622 rows x 5 columns]

### Step 4. See the first 10 entries

In [3]:
chipo.head(10)

   order_id  ...  item_price
0         1  ...      $2.39
1         1  ...      $3.39
2         1  ...      $3.39
3         1  ...      $2.39
4         2  ...     $16.98
5         3  ...     $10.98
6         3  ...      $1.69
7         4  ...     $11.75
8         4  ...      $9.25
9         5  ...      $9.25

[10 rows x 5 columns]

### Step 5. What is the number of observations in the dataset?

In [4]:
# Solution 1

chipo.shape[0]

4622

In [ ]:
# Solution 2

### Step 6. What is the number of columns in the dataset?

In [5]:
chipo.shape[1]

5

### Step 7. Print the name of all the columns.

In [6]:
chipo.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

### Step 8. How is the dataset indexed?

In [10]:
chipo.index

RangeIndex(start=0, stop=4622, step=1)

### Step 9. Which was the most-ordered item?

In [39]:
chipo_most_ordered = chipo\
  .groupby('item_name', as_index=False)\
  .sum()\
  .sort_values(by='quantity', ascending=False, ignore_index=True)

chipo_most_ordered.head(2)

         item_name  order_id  quantity
0     Chicken Bowl    713926       761
1  Chicken Burrito    497303       591

### Step 10. For the most-ordered item, how many items were ordered?

In [40]:
chipo_most_ordered['quantity'][0]

761

### Step 11. What was the most ordered item in the choice_description column?

In [49]:
chipo\
  .groupby('choice_description', as_index=False)\
  .sum()\
  .sort_values('quantity', ascending=False, ignore_index=True)\
  .head()

                                  choice_description  order_id  quantity
0                                        [Diet Coke]    123455       159
1                                             [Coke]    122752       143
2                                           [Sprite]     80426        89
3  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     43088        49
4  [Fresh Tomato Salsa, [Rice, Black Beans, Chees...     36041        42

### Step 12. How many items were orderd in total?

In [51]:
chipo.quantity.sum()

4972

### Step 13. Turn the item price into a float

#### Step 13.a. Check the item price type

In [54]:
chipo.item_price.dtype

dtype('O')

#### Step 13.b. Create a lambda function and change the type of item price

In [62]:
dollarizer = lambda x: x[1:-1]
chipo.item_price = chipo.item_price\
  .apply(dollarizer)\
  .astype('float')

chipo

      order_id  ...  item_price
0            1  ...        2.39
1            1  ...        3.39
2            1  ...        3.39
3            1  ...        2.39
4            2  ...       16.98
...        ...  ...         ...
4617      1833  ...       11.75
4618      1833  ...       11.75
4619      1834  ...       11.25
4620      1834  ...        8.75
4621      1834  ...        8.75

[4622 rows x 5 columns]

#### Step 13.c. Check the item price type

In [63]:
chipo.item_price.dtype

dtype('float64')

### Step 14. How much was the revenue for the period in the dataset?

### Step 15. How many orders were made in the period?

### Step 16. What is the average revenue amount per order?

In [ ]:
# Solution 1

In [ ]:
# Solution 2

### Step 17. How many different items are sold?